micropython/micropython/ports/renesas-ra/boards/VK_RA6M5/ra_gen/hal_data.c
const ether_phy_cfg_t g_ether_phy0_cfg = {

    .channel = 0, .phy_lsi_address = 5, .phy_reset_wait_time = 0x00020000,
    .mii_bit_access_wait_time = 8, .phy_lsi_type =
        ETHER_PHY_LSI_TYPE_ICS1894, .flow_control =
        ETHER_PHY_FLOW_CONTROL_DISABLE, .mii_type =
        ETHER_PHY_MII_TYPE_RMII, .p_context = NULL, .p_extend = NULL,

};
/* Instance structure to use this module. */
const ether_phy_instance_t g_ether_phy0 = { .p_ctrl = &g_ether_phy0_ctrl,
                                            .p_cfg = &g_ether_phy0_cfg, .p_api = &g_ether_phy_on_ether_phy };
ether_instance_ctrl_t g_ether0_ctrl;

uint8_t g_ether0_mac_address[6] = { 0x00, 0x11, 0x22, 0x33, 0x44, 0x55 };

__attribute__((__aligned__(16))) ether_instance_descriptor_t g_ether0_tx_descriptors[4] ETHER_BUFFER_PLACE_IN_SECTION;
__attribute__((__aligned__(16))) ether_instance_descriptor_t g_ether0_rx_descriptors[4] ETHER_BUFFER_PLACE_IN_SECTION;

__attribute__((__aligned__(32))) uint8_t g_ether0_ether_buffer0[1536] ETHER_BUFFER_PLACE_IN_SECTION;
__attribute__((__aligned__(32))) uint8_t g_ether0_ether_buffer1[1536] ETHER_BUFFER_PLACE_IN_SECTION;
__attribute__((__aligned__(32))) uint8_t g_ether0_ether_buffer2[1536] ETHER_BUFFER_PLACE_IN_SECTION;
__attribute__((__aligned__(32))) uint8_t g_ether0_ether_buffer3[1536] ETHER_BUFFER_PLACE_IN_SECTION;
__attribute__((__aligned__(32))) uint8_t g_ether0_ether_buffer4[1536] ETHER_BUFFER_PLACE_IN_SECTION;
__attribute__((__aligned__(32))) uint8_t g_ether0_ether_buffer5[1536] ETHER_BUFFER_PLACE_IN_SECTION;
__attribute__((__aligned__(32))) uint8_t g_ether0_ether_buffer6[1536] ETHER_BUFFER_PLACE_IN_SECTION;
__attribute__((__aligned__(32))) uint8_t g_ether0_ether_buffer7[1536] ETHER_BUFFER_PLACE_IN_SECTION;

uint8_t *pp_g_ether0_ether_buffers[8] = { (uint8_t *)&g_ether0_ether_buffer0[0],
                                          (uint8_t *)&g_ether0_ether_buffer1[0],
                                          (uint8_t *)&g_ether0_ether_buffer2[0],
                                          (uint8_t *)&g_ether0_ether_buffer3[0],
                                          (uint8_t *)&g_ether0_ether_buffer4[0],
                                          (uint8_t *)&g_ether0_ether_buffer5[0],
                                          (uint8_t *)&g_ether0_ether_buffer6[0],
                                          (uint8_t *)&g_ether0_ether_buffer7[0], };

const ether_extended_cfg_t g_ether0_extended_cfg_t = { .p_rx_descriptors =
                                                           g_ether0_rx_descriptors, .p_tx_descriptors = g_ether0_tx_descriptors, };

const ether_cfg_t g_ether0_cfg = { .channel = 0, .zerocopy =
                                       ETHER_ZEROCOPY_DISABLE, .multicast = ETHER_MULTICAST_ENABLE,
                                   .promiscuous = ETHER_PROMISCUOUS_DISABLE, .flow_control =
                                       ETHER_FLOW_CONTROL_DISABLE, .padding = ETHER_PADDING_DISABLE,
                                   .padding_offset = 1, .broadcast_filter = 0, .p_mac_address =
                                       g_ether0_mac_address,

                                   .num_tx_descriptors = 4, .num_rx_descriptors = 4,

                                   .pp_ether_buffers = pp_g_ether0_ether_buffers,

                                   .ether_buffer_size = 1536,

                                   #if defined(VECTOR_NUMBER_EDMAC0_EINT)
                                   .irq = VECTOR_NUMBER_EDMAC0_EINT,
                                   #else
                                   .irq = FSP_INVALID_VECTOR,
                                   #endif

                                   .interrupt_priority = (12),

                                   .p_callback = ETH_IRQHandler, .p_ether_phy_instance = &g_ether_phy0,
                                   .p_context = NULL, .p_extend = &g_ether0_extended_cfg_t, };

/* Instance structure to use this module. */
const ether_instance_t g_ether0 = { .p_ctrl = &g_ether0_ctrl, .p_cfg =
                                        &g_ether0_cfg, .p_api = &g_ether_on_ether };
dtc_instance_ctrl_t g_transfer2_ctrl;

transfer_info_t g_transfer2_info = { .transfer_settings_word_b.dest_addr_mode =
                                         TRANSFER_ADDR_MODE_FIXED, .transfer_settings_word_b.repeat_area =
                                         TRANSFER_REPEAT_AREA_SOURCE, .transfer_settings_word_b.irq =
                                         TRANSFER_IRQ_END, .transfer_settings_word_b.chain_mode =
                                         TRANSFER_CHAIN_MODE_DISABLED, .transfer_settings_word_b.src_addr_mode =
                                         TRANSFER_ADDR_MODE_INCREMENTED, .transfer_settings_word_b.size =
                                         TRANSFER_SIZE_4_BYTE, .transfer_settings_word_b.mode =
                                         TRANSFER_MODE_NORMAL, .p_dest = (void *)NULL, .p_src =
                                         (void const *)NULL, .num_blocks = 0, .length = 128, };

const dtc_extended_cfg_t g_transfer2_cfg_extend = { .activation_source =
                                                        VECTOR_NUMBER_SDHIMMC0_DMA_REQ, };
const transfer_cfg_t g_transfer2_cfg = { .p_info = &g_transfer2_info,
                                         .p_extend = &g_transfer2_cfg_extend, };

/* Instance structure to use this module. */
const transfer_instance_t g_transfer2 = { .p_ctrl = &g_transfer2_ctrl, .p_cfg =
                                              &g_transfer2_cfg, .p_api = &g_transfer_on_dtc };
#define RA_NOT_DEFINED (UINT32_MAX)
#if (RA_NOT_DEFINED) != (RA_NOT_DEFINED)

/* If the transfer module is DMAC, define a DMAC transfer callback. */
#include "r_dmac.h"
extern void r_sdhi_transfer_callback(sdhi_instance_ctrl_t *p_ctrl);

void g_sdmmc0_dmac_callback(dmac_callback_args_t *p_args) {
    r_sdhi_transfer_callback((sdhi_instance_ctrl_t *)p_args->p_context);
}
#endif
#undef RA_NOT_DEFINED

sdhi_instance_ctrl_t g_sdmmc0_ctrl;
sdmmc_cfg_t g_sdmmc0_cfg = { .bus_width = SDMMC_BUS_WIDTH_4_BITS, .channel = 0,
                             .p_callback = sdhi_ISR, .p_context = NULL, .block_size = 512,
                             .card_detect = SDMMC_CARD_DETECT_CD, .write_protect =
                                 SDMMC_WRITE_PROTECT_WP,

                             .p_extend = NULL, .p_lower_lvl_transfer = &g_transfer2,

