micropython/micropython/ports/renesas-ra/boards/VK_RA6M5/ra_gen/hal_data.c
                             .access_ipl = (12), .sdio_ipl = BSP_IRQ_DISABLED, .card_ipl = (12),
                             .dma_req_ipl = (12),
                             #if defined(VECTOR_NUMBER_SDHIMMC0_ACCS)
                             .access_irq = VECTOR_NUMBER_SDHIMMC0_ACCS,
                             #else
                             .access_irq = FSP_INVALID_VECTOR,
                             #endif
                             #if defined(VECTOR_NUMBER_SDHIMMC0_CARD)
                             .card_irq = VECTOR_NUMBER_SDHIMMC0_CARD,
                             #else
                             .card_irq = FSP_INVALID_VECTOR,
                             #endif
                             .sdio_irq = FSP_INVALID_VECTOR,
                             #if defined(VECTOR_NUMBER_SDHIMMC0_DMA_REQ)
                             .dma_req_irq = VECTOR_NUMBER_SDHIMMC0_DMA_REQ,
                             #else
                             .dma_req_irq = FSP_INVALID_VECTOR,
                             #endif
};
/* Instance structure to use this module. */
const sdmmc_instance_t g_sdmmc0 = { .p_ctrl = &g_sdmmc0_ctrl, .p_cfg =
                                        &g_sdmmc0_cfg, .p_api = &g_sdmmc_on_sdhi };
qspi_instance_ctrl_t g_qspi0_ctrl;

static const spi_flash_erase_command_t g_qspi0_erase_command_list[] = {
    #if 4096 > 0
    { .command = 0x20, .size = 4096 },
    #endif
    #if 32768 > 0
    { .command = 0x52, .size = 32768 },
    #endif
    #if 65536 > 0
    { .command = 0xD8, .size = 65536 },
    #endif
    #if 0xC7 > 0
    { .command = 0xC7, .size = SPI_FLASH_ERASE_SIZE_CHIP_ERASE },
    #endif
};
static const qspi_extended_cfg_t g_qspi0_extended_cfg = {
    .min_qssl_deselect_cycles = QSPI_QSSL_MIN_HIGH_LEVEL_9_QSPCLK,
    .qspclk_div = QSPI_QSPCLK_DIV_2,
};
const spi_flash_cfg_t g_qspi0_cfg = { .spi_protocol =
                                          SPI_FLASH_PROTOCOL_EXTENDED_SPI, .read_mode =
                                          SPI_FLASH_READ_MODE_FAST_READ_QUAD_IO, .address_bytes =
                                          SPI_FLASH_ADDRESS_BYTES_3, .dummy_clocks =
                                          SPI_FLASH_DUMMY_CLOCKS_DEFAULT, .page_program_address_lines =
                                          SPI_FLASH_DATA_LINES_1, .page_size_bytes = 256, .page_program_command =
                                          0x32, .write_enable_command = 0x06, .status_command = 0x05,
                                      .write_status_bit = 0, .xip_enter_command = 0x20, .xip_exit_command =
                                          0xFF, .p_erase_command_list = &g_qspi0_erase_command_list[0],
                                      .erase_command_list_length = sizeof(g_qspi0_erase_command_list)
                                          / sizeof(g_qspi0_erase_command_list[0]), .p_extend =
                                          &g_qspi0_extended_cfg, };
/** This structure encompasses everything that is needed to use an instance of this interface. */
const spi_flash_instance_t g_qspi0 = { .p_ctrl = &g_qspi0_ctrl, .p_cfg =
                                           &g_qspi0_cfg, .p_api = &g_qspi_on_spi_flash, };
iic_master_instance_ctrl_t g_i2c_master2_ctrl;
const iic_master_extended_cfg_t g_i2c_master2_extend =
{ .timeout_mode = IIC_MASTER_TIMEOUT_MODE_SHORT, .timeout_scl_low =
      IIC_MASTER_TIMEOUT_SCL_LOW_ENABLED,
  /* Actual calculated bitrate: 98425. Actual calculated duty cycle: 50%. */ .clock_settings.brl_value =
      28, .clock_settings.brh_value = 28,
  .clock_settings.cks_value = 3, };
const i2c_master_cfg_t g_i2c_master2_cfg = { .channel = 2, .rate =
                                                 I2C_MASTER_RATE_STANDARD, .slave = 0x00, .addr_mode =
                                                 I2C_MASTER_ADDR_MODE_7BIT,
#define RA_NOT_DEFINED (1)
                                             #if (RA_NOT_DEFINED == RA_NOT_DEFINED)
                                             .p_transfer_tx = NULL,
                                             #else
                                             .p_transfer_tx = &RA_NOT_DEFINED,
                                             #endif
                                             #if (RA_NOT_DEFINED == RA_NOT_DEFINED)
                                             .p_transfer_rx = NULL,
                                             #else
                                             .p_transfer_rx = &RA_NOT_DEFINED,
                                             #endif
#undef RA_NOT_DEFINED
                                             .p_callback = callback_iic, .p_context = NULL,
                                             #if defined(VECTOR_NUMBER_IIC2_RXI)
                                             .rxi_irq = VECTOR_NUMBER_IIC2_RXI,
                                             #else
                                             .rxi_irq = FSP_INVALID_VECTOR,
                                             #endif
                                             #if defined(VECTOR_NUMBER_IIC2_TXI)
                                             .txi_irq = VECTOR_NUMBER_IIC2_TXI,
                                             #else
                                             .txi_irq = FSP_INVALID_VECTOR,
                                             #endif
                                             #if defined(VECTOR_NUMBER_IIC2_TEI)
                                             .tei_irq = VECTOR_NUMBER_IIC2_TEI,
                                             #else
                                             .tei_irq = FSP_INVALID_VECTOR,
                                             #endif
                                             #if defined(VECTOR_NUMBER_IIC2_ERI)
                                             .eri_irq = VECTOR_NUMBER_IIC2_ERI,
                                             #else
                                             .eri_irq = FSP_INVALID_VECTOR,
                                             #endif
                                             .ipl = (12), .p_extend = &g_i2c_master2_extend, };
/* Instance structure to use this module. */
const i2c_master_instance_t g_i2c_master2 = { .p_ctrl = &g_i2c_master2_ctrl,
                                              .p_cfg = &g_i2c_master2_cfg, .p_api = &g_i2c_master_on_iic };
adc_instance_ctrl_t g_adc1_ctrl;
const adc_extended_cfg_t g_adc1_cfg_extend = { .add_average_count = ADC_ADD_OFF,
                                               .clearing = ADC_CLEAR_AFTER_READ_ON, .trigger_group_b =
                                                   ADC_TRIGGER_SYNC_ELC, .double_trigger_mode =
                                                   ADC_DOUBLE_TRIGGER_DISABLED, .adc_vref_control =
                                                   ADC_VREF_CONTROL_VREFH, .enable_adbuf = 0,
                                               #if defined(VECTOR_NUMBER_ADC1_WINDOW_A)
                                               .window_a_irq = VECTOR_NUMBER_ADC1_WINDOW_A,
                                               #else
                                               .window_a_irq = FSP_INVALID_VECTOR,
                                               #endif
                                               .window_a_ipl = (BSP_IRQ_DISABLED),
                                               #if defined(VECTOR_NUMBER_ADC1_WINDOW_B)
                                               .window_b_irq = VECTOR_NUMBER_ADC1_WINDOW_B,
                                               #else
                                               .window_b_irq = FSP_INVALID_VECTOR,
                                               #endif
                                               .window_b_ipl = (BSP_IRQ_DISABLED), };
const adc_cfg_t g_adc1_cfg = { .unit = 1, .mode = ADC_MODE_SINGLE_SCAN,
                               .resolution = ADC_RESOLUTION_12_BIT, .alignment =
                                   (adc_alignment_t)ADC_ALIGNMENT_RIGHT, .trigger =
                                   ADC_TRIGGER_SOFTWARE, .p_callback = NULL,
                               /** If NULL then do not add & */
                               #if defined(NULL)
                               .p_context = NULL,
                               #else
                               .p_context = &NULL,
                               #endif
                               .p_extend = &g_adc1_cfg_extend,
                               #if defined(VECTOR_NUMBER_ADC1_SCAN_END)
                               .scan_end_irq = VECTOR_NUMBER_ADC1_SCAN_END,
                               #else
                               .scan_end_irq = FSP_INVALID_VECTOR,
                               #endif
                               .scan_end_ipl = (BSP_IRQ_DISABLED),
                               #if defined(VECTOR_NUMBER_ADC1_SCAN_END_B)
                               .scan_end_b_irq = VECTOR_NUMBER_ADC1_SCAN_END_B,
                               #else
                               .scan_end_b_irq = FSP_INVALID_VECTOR,
                               #endif
                               .scan_end_b_ipl = (BSP_IRQ_DISABLED), };
#if ((0) | (0))
const adc_window_cfg_t g_adc1_window_cfg =
{
    .compare_mask = 0,
    .compare_mode_mask = 0,
    .compare_cfg = (0) | (0) | (0) | (ADC_COMPARE_CFG_EVENT_OUTPUT_OR),
    .compare_ref_low = 0,
    .compare_ref_high = 0,
    .compare_b_channel = (ADC_WINDOW_B_CHANNEL_0),
    .compare_b_mode = (ADC_WINDOW_B_MODE_LESS_THAN_OR_OUTSIDE),
    .compare_b_ref_low = 0,
    .compare_b_ref_high = 0,
};
#endif
const adc_channel_cfg_t g_adc1_channel_cfg = { .scan_mask = 0,
                                               .scan_mask_group_b = 0, .priority_group_a = ADC_GROUP_A_PRIORITY_OFF,
                                               .add_mask = 0, .sample_hold_mask = 0, .sample_hold_states = 24,
                                               #if ((0) | (0))
                                               .p_window_cfg = (adc_window_cfg_t *)&g_adc1_window_cfg,
                                               #else
                                               .p_window_cfg = NULL,
                                               #endif
};
/* Instance structure to use this module. */
const adc_instance_t g_adc1 = { .p_ctrl = &g_adc1_ctrl, .p_cfg = &g_adc1_cfg,
                                .p_channel_cfg = &g_adc1_channel_cfg, .p_api = &g_adc_on_adc };
adc_instance_ctrl_t g_adc0_ctrl;
const adc_extended_cfg_t g_adc0_cfg_extend = { .add_average_count = ADC_ADD_OFF,
                                               .clearing = ADC_CLEAR_AFTER_READ_ON, .trigger_group_b =
                                                   ADC_TRIGGER_SYNC_ELC, .double_trigger_mode =
                                                   ADC_DOUBLE_TRIGGER_DISABLED, .adc_vref_control =
                                                   ADC_VREF_CONTROL_VREFH, .enable_adbuf = 0,
                                               #if defined(VECTOR_NUMBER_ADC0_WINDOW_A)
                                               .window_a_irq = VECTOR_NUMBER_ADC0_WINDOW_A,
                                               #else
                                               .window_a_irq = FSP_INVALID_VECTOR,
                                               #endif
                                               .window_a_ipl = (BSP_IRQ_DISABLED),
                                               #if defined(VECTOR_NUMBER_ADC0_WINDOW_B)
                                               .window_b_irq = VECTOR_NUMBER_ADC0_WINDOW_B,
                                               #else
                                               .window_b_irq = FSP_INVALID_VECTOR,
                                               #endif
                                               .window_b_ipl = (BSP_IRQ_DISABLED), };
const adc_cfg_t g_adc0_cfg = { .unit = 0, .mode = ADC_MODE_SINGLE_SCAN,
                               .resolution = ADC_RESOLUTION_12_BIT, .alignment =
                                   (adc_alignment_t)ADC_ALIGNMENT_RIGHT, .trigger =
                                   ADC_TRIGGER_SOFTWARE, .p_callback = NULL,
                               /** If NULL then do not add & */
                               #if defined(NULL)
                               .p_context = NULL,
                               #else
                               .p_context = &NULL,
                               #endif
                               .p_extend = &g_adc0_cfg_extend,
                               #if defined(VECTOR_NUMBER_ADC0_SCAN_END)
                               .scan_end_irq = VECTOR_NUMBER_ADC0_SCAN_END,
                               #else
                               .scan_end_irq = FSP_INVALID_VECTOR,
                               #endif
                               .scan_end_ipl = (BSP_IRQ_DISABLED),
                               #if defined(VECTOR_NUMBER_ADC0_SCAN_END_B)
                               .scan_end_b_irq = VECTOR_NUMBER_ADC0_SCAN_END_B,
                               #else
                               .scan_end_b_irq = FSP_INVALID_VECTOR,
                               #endif
                               .scan_end_b_ipl = (BSP_IRQ_DISABLED), };
#if ((0) | (0))
const adc_window_cfg_t g_adc0_window_cfg =
{
    .compare_mask = 0,
    .compare_mode_mask = 0,
    .compare_cfg = (0) | (0) | (0) | (ADC_COMPARE_CFG_EVENT_OUTPUT_OR),
    .compare_ref_low = 0,
    .compare_ref_high = 0,
    .compare_b_channel = (ADC_WINDOW_B_CHANNEL_0),
    .compare_b_mode = (ADC_WINDOW_B_MODE_LESS_THAN_OR_OUTSIDE),
    .compare_b_ref_low = 0,
    .compare_b_ref_high = 0,
};
#endif
const adc_channel_cfg_t g_adc0_channel_cfg = { .scan_mask = 0,
                                               .scan_mask_group_b = 0, .priority_group_a = ADC_GROUP_A_PRIORITY_OFF,
                                               .add_mask = 0, .sample_hold_mask = 0, .sample_hold_states = 24,
                                               #if ((0) | (0))
                                               .p_window_cfg = (adc_window_cfg_t *)&g_adc0_window_cfg,
                                               #else
                                               .p_window_cfg = NULL,
                                               #endif
};
/* Instance structure to use this module. */
const adc_instance_t g_adc0 = { .p_ctrl = &g_adc0_ctrl, .p_cfg = &g_adc0_cfg,
                                .p_channel_cfg = &g_adc0_channel_cfg, .p_api = &g_adc_on_adc };
lpm_instance_ctrl_t g_lpm0_ctrl;

