micropython/micropython/ports/renesas-ra/boards/VK_RA6M5/ra_gen/hal_data.c
const lpm_cfg_t g_lpm0_cfg = { .low_power_mode = LPM_MODE_SLEEP,
                               .standby_wake_sources = LPM_STANDBY_WAKE_SOURCE_RTCALM
                                   | (lpm_standby_wake_source_t)0,
                               #if BSP_FEATURE_LPM_HAS_SNOOZE
                               .snooze_cancel_sources = LPM_SNOOZE_CANCEL_SOURCE_NONE,
                               .snooze_request_source = LPM_SNOOZE_REQUEST_RXD0_FALLING,
                               .snooze_end_sources = (lpm_snooze_end_t)0,
                               .dtc_state_in_snooze = LPM_SNOOZE_DTC_DISABLE,
                               #endif
                               #if BSP_FEATURE_LPM_HAS_SBYCR_OPE
                               .output_port_enable = LPM_OUTPUT_PORT_ENABLE_RETAIN,
                               #endif
                               #if BSP_FEATURE_LPM_HAS_DEEP_STANDBY
                               .io_port_state = LPM_IO_PORT_NO_CHANGE,
                               .power_supply_state = LPM_POWER_SUPPLY_DEEPCUT0,
                               .deep_standby_cancel_source = (lpm_deep_standby_cancel_source_t)0,
                               .deep_standby_cancel_edge = (lpm_deep_standby_cancel_edge_t)0,
                               #endif
                               #if BSP_FEATURE_LPM_HAS_PDRAMSCR
                               .ram_retention_cfg.ram_retention = (uint8_t)(0),
                               .ram_retention_cfg.tcm_retention = false,
                               #endif
                               #if BSP_FEATURE_LPM_HAS_DPSBYCR_SRKEEP
                               .ram_retention_cfg.standby_ram_retention = false,
                               #endif
                               #if BSP_FEATURE_LPM_HAS_LDO_CONTROL
                               .ldo_standby_cfg.pll1_ldo = false,
                               .ldo_standby_cfg.pll2_ldo = false,
                               .ldo_standby_cfg.hoco_ldo = false,
                               #endif
                               .p_extend = NULL, };

const lpm_instance_t g_lpm0 = { .p_api = &g_lpm_on_lpm, .p_ctrl = &g_lpm0_ctrl,
                                .p_cfg = &g_lpm0_cfg };
dtc_instance_ctrl_t g_transfer1_ctrl;

transfer_info_t g_transfer1_info = { .transfer_settings_word_b.dest_addr_mode =
                                         TRANSFER_ADDR_MODE_INCREMENTED, .transfer_settings_word_b.repeat_area =
                                         TRANSFER_REPEAT_AREA_DESTINATION, .transfer_settings_word_b.irq =
                                         TRANSFER_IRQ_END, .transfer_settings_word_b.chain_mode =
                                         TRANSFER_CHAIN_MODE_DISABLED, .transfer_settings_word_b.src_addr_mode =
                                         TRANSFER_ADDR_MODE_FIXED, .transfer_settings_word_b.size =
                                         TRANSFER_SIZE_2_BYTE, .transfer_settings_word_b.mode =
                                         TRANSFER_MODE_NORMAL, .p_dest = (void *)NULL, .p_src =
                                         (void const *)NULL, .num_blocks = 0, .length = 0, };

const dtc_extended_cfg_t g_transfer1_cfg_extend = { .activation_source =
                                                        VECTOR_NUMBER_SPI0_RXI, };
const transfer_cfg_t g_transfer1_cfg = { .p_info = &g_transfer1_info,
                                         .p_extend = &g_transfer1_cfg_extend, };

/* Instance structure to use this module. */
const transfer_instance_t g_transfer1 = { .p_ctrl = &g_transfer1_ctrl, .p_cfg =
                                              &g_transfer1_cfg, .p_api = &g_transfer_on_dtc };
dtc_instance_ctrl_t g_transfer0_ctrl;

transfer_info_t g_transfer0_info = { .transfer_settings_word_b.dest_addr_mode =
                                         TRANSFER_ADDR_MODE_FIXED, .transfer_settings_word_b.repeat_area =
                                         TRANSFER_REPEAT_AREA_SOURCE, .transfer_settings_word_b.irq =
                                         TRANSFER_IRQ_END, .transfer_settings_word_b.chain_mode =
                                         TRANSFER_CHAIN_MODE_DISABLED, .transfer_settings_word_b.src_addr_mode =
                                         TRANSFER_ADDR_MODE_INCREMENTED, .transfer_settings_word_b.size =
                                         TRANSFER_SIZE_2_BYTE, .transfer_settings_word_b.mode =
                                         TRANSFER_MODE_NORMAL, .p_dest = (void *)NULL, .p_src =
                                         (void const *)NULL, .num_blocks = 0, .length = 0, };

const dtc_extended_cfg_t g_transfer0_cfg_extend = { .activation_source =
                                                        VECTOR_NUMBER_SPI0_TXI, };
const transfer_cfg_t g_transfer0_cfg = { .p_info = &g_transfer0_info,
                                         .p_extend = &g_transfer0_cfg_extend, };

/* Instance structure to use this module. */
const transfer_instance_t g_transfer0 = { .p_ctrl = &g_transfer0_ctrl, .p_cfg =
                                              &g_transfer0_cfg, .p_api = &g_transfer_on_dtc };
#define RA_NOT_DEFINED (UINT32_MAX)
#if (RA_NOT_DEFINED) != (RA_NOT_DEFINED)

/* If the transfer module is DMAC, define a DMAC transfer callback. */
#include "r_dmac.h"
extern void spi_tx_dmac_callback(spi_instance_ctrl_t const *const p_ctrl);

void g_spi0_tx_transfer_callback(dmac_callback_args_t *p_args) {
    FSP_PARAMETER_NOT_USED(p_args);
    spi_tx_dmac_callback(&g_spi0_ctrl);
}
#endif

#if (RA_NOT_DEFINED) != (RA_NOT_DEFINED)

/* If the transfer module is DMAC, define a DMAC transfer callback. */
#include "r_dmac.h"
extern void spi_rx_dmac_callback(spi_instance_ctrl_t const *const p_ctrl);

void g_spi0_rx_transfer_callback(dmac_callback_args_t *p_args) {
    FSP_PARAMETER_NOT_USED(p_args);
    spi_rx_dmac_callback(&g_spi0_ctrl);
}
#endif
#undef RA_NOT_DEFINED

spi_instance_ctrl_t g_spi0_ctrl;

/** SPI extended configuration for SPI HAL driver */
const spi_extended_cfg_t g_spi0_ext_cfg = { .spi_clksyn = SPI_SSL_MODE_CLK_SYN,
                                            .spi_comm = SPI_COMMUNICATION_FULL_DUPLEX, .ssl_polarity = SPI_SSLP_LOW,
                                            .ssl_select = SPI_SSL_SELECT_SSL0, .mosi_idle =
                                                SPI_MOSI_IDLE_VALUE_FIXING_DISABLE, .parity =
                                                SPI_PARITY_MODE_DISABLE, .byte_swap = SPI_BYTE_SWAP_DISABLE,
                                            .spck_div = {
                                                /* Actual calculated bitrate: 12500000. */ .spbr = 3, .brdv = 0
                                            },
                                            .spck_delay = SPI_DELAY_COUNT_1,
                                            .ssl_negation_delay = SPI_DELAY_COUNT_1, .next_access_delay =
                                                SPI_DELAY_COUNT_1 };

/** SPI configuration for SPI HAL driver */
const spi_cfg_t g_spi0_cfg = { .channel = 0,

