micropython/micropython/ports/renesas-ra/boards/VK_RA6M5/ra_gen/hal_data.c
                               #if defined(VECTOR_NUMBER_SPI0_RXI)
                               .rxi_irq = VECTOR_NUMBER_SPI0_RXI,
                               #else
                               .rxi_irq = FSP_INVALID_VECTOR,
                               #endif
                               #if defined(VECTOR_NUMBER_SPI0_TXI)
                               .txi_irq = VECTOR_NUMBER_SPI0_TXI,
                               #else
                               .txi_irq = FSP_INVALID_VECTOR,
                               #endif
                               #if defined(VECTOR_NUMBER_SPI0_TEI)
                               .tei_irq = VECTOR_NUMBER_SPI0_TEI,
                               #else
                               .tei_irq = FSP_INVALID_VECTOR,
                               #endif
                               #if defined(VECTOR_NUMBER_SPI0_ERI)
                               .eri_irq = VECTOR_NUMBER_SPI0_ERI,
                               #else
                               .eri_irq = FSP_INVALID_VECTOR,
                               #endif

                               .rxi_ipl = (12), .txi_ipl = (12), .tei_ipl = (12), .eri_ipl = (12),

                               .operating_mode = SPI_MODE_MASTER,

                               .clk_phase = SPI_CLK_PHASE_EDGE_ODD, .clk_polarity =
                                   SPI_CLK_POLARITY_LOW,

                               .mode_fault = SPI_MODE_FAULT_ERROR_DISABLE, .bit_order =
                                   SPI_BIT_ORDER_MSB_FIRST, .p_transfer_tx = g_spi0_P_TRANSFER_TX,
                               .p_transfer_rx = g_spi0_P_TRANSFER_RX, .p_callback = spi_callback,

                               .p_context = NULL, .p_extend = (void *)&g_spi0_ext_cfg, };

/* Instance structure to use this module. */
const spi_instance_t g_spi0 = { .p_ctrl = &g_spi0_ctrl, .p_cfg = &g_spi0_cfg,
                                .p_api = &g_spi_on_spi };
agt_instance_ctrl_t g_timer1_ctrl;
const agt_extended_cfg_t g_timer1_extend =
{ .count_source = AGT_CLOCK_PCLKB, .agto = AGT_PIN_CFG_DISABLED,
  .agtoab_settings_b.agtoa = AGT_PIN_CFG_DISABLED,
  .agtoab_settings_b.agtob = AGT_PIN_CFG_DISABLED,
  .measurement_mode = AGT_MEASURE_DISABLED, .agtio_filter =
      AGT_AGTIO_FILTER_NONE, .enable_pin =
      AGT_ENABLE_PIN_NOT_USED, .trigger_edge =
      AGT_TRIGGER_EDGE_RISING, };
const timer_cfg_t g_timer1_cfg = { .mode = TIMER_MODE_PERIODIC,
/* Actual period: 0.00131072 seconds. Actual duty: 50%. */ .period_counts =
                                       (uint32_t)0x10000, .duty_cycle_counts = 0x8000, .source_div =
                                       (timer_source_div_t)0, .channel = 1, .p_callback = callback_agt,
/** If NULL then do not add & */
                                   #if defined(NULL)
                                   .p_context = NULL,
                                   #else
                                   .p_context = &NULL,
                                   #endif
                                   .p_extend = &g_timer1_extend, .cycle_end_ipl = (5),
                                   #if defined(VECTOR_NUMBER_AGT1_INT)
                                   .cycle_end_irq = VECTOR_NUMBER_AGT1_INT,
                                   #else
                                   .cycle_end_irq = FSP_INVALID_VECTOR,
                                   #endif
};
/* Instance structure to use this module. */
const timer_instance_t g_timer1 = { .p_ctrl = &g_timer1_ctrl, .p_cfg =
                                        &g_timer1_cfg, .p_api = &g_timer_on_agt };
agt_instance_ctrl_t g_timer0_ctrl;
const agt_extended_cfg_t g_timer0_extend =
{ .count_source = AGT_CLOCK_PCLKB, .agto = AGT_PIN_CFG_DISABLED,
  .agtoab_settings_b.agtoa = AGT_PIN_CFG_DISABLED,
  .agtoab_settings_b.agtob = AGT_PIN_CFG_DISABLED,
  .measurement_mode = AGT_MEASURE_DISABLED, .agtio_filter =
      AGT_AGTIO_FILTER_NONE, .enable_pin =
      AGT_ENABLE_PIN_NOT_USED, .trigger_edge =
      AGT_TRIGGER_EDGE_RISING, };
const timer_cfg_t g_timer0_cfg = { .mode = TIMER_MODE_PERIODIC,
/* Actual period: 0.00131072 seconds. Actual duty: 50%. */ .period_counts =
                                       (uint32_t)0x10000, .duty_cycle_counts = 0x8000, .source_div =
                                       (timer_source_div_t)0, .channel = 0, .p_callback = callback_agt,
/** If NULL then do not add & */
                                   #if defined(NULL)
                                   .p_context = NULL,
                                   #else
                                   .p_context = &NULL,
                                   #endif
                                   .p_extend = &g_timer0_extend, .cycle_end_ipl = (5),
                                   #if defined(VECTOR_NUMBER_AGT0_INT)
                                   .cycle_end_irq = VECTOR_NUMBER_AGT0_INT,
                                   #else
                                   .cycle_end_irq = FSP_INVALID_VECTOR,
                                   #endif
};
/* Instance structure to use this module. */
const timer_instance_t g_timer0 = { .p_ctrl = &g_timer0_ctrl, .p_cfg =
                                        &g_timer0_cfg, .p_api = &g_timer_on_agt };
flash_hp_instance_ctrl_t g_flash0_ctrl;
const flash_cfg_t g_flash0_cfg = { .data_flash_bgo = false, .p_callback = NULL,
                                   .p_context = NULL,
                                   #if defined(VECTOR_NUMBER_FCU_FRDYI)
                                   .irq = VECTOR_NUMBER_FCU_FRDYI,
                                   #else
                                   .irq = FSP_INVALID_VECTOR,
                                   #endif
                                   #if defined(VECTOR_NUMBER_FCU_FIFERR)
                                   .err_irq = VECTOR_NUMBER_FCU_FIFERR,
                                   #else
                                   .err_irq = FSP_INVALID_VECTOR,
                                   #endif
                                   .err_ipl = (BSP_IRQ_DISABLED), .ipl = (BSP_IRQ_DISABLED), };
/* Instance structure to use this module. */
const flash_instance_t g_flash0 = { .p_ctrl = &g_flash0_ctrl, .p_cfg =
                                        &g_flash0_cfg, .p_api = &g_flash_on_flash_hp };
rtc_instance_ctrl_t g_rtc0_ctrl;
const rtc_error_adjustment_cfg_t g_rtc0_err_cfg = { .adjustment_mode =
                                                        RTC_ERROR_ADJUSTMENT_MODE_AUTOMATIC, .adjustment_period =
                                                        RTC_ERROR_ADJUSTMENT_PERIOD_10_SECOND, .adjustment_type =
                                                        RTC_ERROR_ADJUSTMENT_NONE, .adjustment_value = 0, };
const rtc_cfg_t g_rtc0_cfg = { .clock_source = RTC_CLOCK_SOURCE_LOCO,
                               .freq_compare_value_loco = 255, .p_err_cfg = &g_rtc0_err_cfg,
                               .p_callback = NULL, .p_context = NULL, .alarm_ipl = (14),
                               .periodic_ipl = (14), .carry_ipl = (14),
                               #if defined(VECTOR_NUMBER_RTC_ALARM)
                               .alarm_irq = VECTOR_NUMBER_RTC_ALARM,
                               #else
                               .alarm_irq = FSP_INVALID_VECTOR,
                               #endif
                               #if defined(VECTOR_NUMBER_RTC_PERIOD)
                               .periodic_irq = VECTOR_NUMBER_RTC_PERIOD,
                               #else
                               .periodic_irq = FSP_INVALID_VECTOR,
                               #endif
                               #if defined(VECTOR_NUMBER_RTC_CARRY)
                               .carry_irq = VECTOR_NUMBER_RTC_CARRY,
                               #else
                               .carry_irq = FSP_INVALID_VECTOR,
                               #endif
};
/* Instance structure to use this module. */
const rtc_instance_t g_rtc0 = { .p_ctrl = &g_rtc0_ctrl, .p_cfg = &g_rtc0_cfg,
                                .p_api = &g_rtc_on_rtc };
sci_uart_instance_ctrl_t g_uart9_ctrl;

baud_setting_t g_uart9_baud_setting = {
/* Baud rate calculated with 0.469% error. */ .semr_baudrate_bits_b.abcse = 0,
    .semr_baudrate_bits_b.abcs = 0, .semr_baudrate_bits_b.bgdm = 1,
    .cks = 0, .brr = 53, .mddr = (uint8_t)256, .semr_baudrate_bits_b.brme =
        false
};

