micropython/micropython/ports/renesas-ra/boards/VK_RA6M5/ra_gen/hal_data.c
/** UART extended configuration for UARTonSCI HAL driver */
const sci_uart_extended_cfg_t g_uart6_cfg_extend = {
    .clock = SCI_UART_CLOCK_INT, .rx_edge_start =
        SCI_UART_START_BIT_FALLING_EDGE, .noise_cancel =
        SCI_UART_NOISE_CANCELLATION_DISABLE, .rx_fifo_trigger =
        SCI_UART_RX_FIFO_TRIGGER_MAX, .p_baud_setting =
        &g_uart6_baud_setting,
    .flow_control = SCI_UART_FLOW_CONTROL_RTS,
    #if 0xFF != 0xFF
    .flow_control_pin = BSP_IO_PORT_FF_PIN_0xFF,
    #else
    .flow_control_pin = (bsp_io_port_pin_t)UINT16_MAX,
    #endif
    .rs485_setting = { .enable = SCI_UART_RS485_DISABLE, .polarity =
                           SCI_UART_RS485_DE_POLARITY_HIGH,
                       #if 0xFF != 0xFF
                       .de_control_pin = BSP_IO_PORT_FF_PIN_0xFF,
                       #else
                       .de_control_pin = (bsp_io_port_pin_t)UINT16_MAX,
                       #endif
    },
};

/** UART interface configuration */
const uart_cfg_t g_uart6_cfg = { .channel = 6, .data_bits = UART_DATA_BITS_8,
                                 .parity = UART_PARITY_OFF, .stop_bits = UART_STOP_BITS_1, .p_callback =
                                     user_uart_callback, .p_context = NULL, .p_extend =
                                     &g_uart6_cfg_extend,
#define RA_NOT_DEFINED (1)
                                 #if (RA_NOT_DEFINED == RA_NOT_DEFINED)
                                 .p_transfer_tx = NULL,
                                 #else
                                 .p_transfer_tx = &RA_NOT_DEFINED,
                                 #endif
                                 #if (RA_NOT_DEFINED == RA_NOT_DEFINED)
                                 .p_transfer_rx = NULL,
                                 #else
                                 .p_transfer_rx = &RA_NOT_DEFINED,
                                 #endif
#undef RA_NOT_DEFINED
                                 .rxi_ipl = (12), .txi_ipl = (12), .tei_ipl = (12), .eri_ipl = (12),
                                 #if defined(VECTOR_NUMBER_SCI6_RXI)
                                 .rxi_irq = VECTOR_NUMBER_SCI6_RXI,
                                 #else
                                 .rxi_irq = FSP_INVALID_VECTOR,
                                 #endif
                                 #if defined(VECTOR_NUMBER_SCI6_TXI)
                                 .txi_irq = VECTOR_NUMBER_SCI6_TXI,
                                 #else
                                 .txi_irq = FSP_INVALID_VECTOR,
                                 #endif
                                 #if defined(VECTOR_NUMBER_SCI6_TEI)
                                 .tei_irq = VECTOR_NUMBER_SCI6_TEI,
                                 #else
                                 .tei_irq = FSP_INVALID_VECTOR,
                                 #endif
                                 #if defined(VECTOR_NUMBER_SCI6_ERI)
                                 .eri_irq = VECTOR_NUMBER_SCI6_ERI,
                                 #else
                                 .eri_irq = FSP_INVALID_VECTOR,
                                 #endif
};

/* Instance structure to use this module. */
const uart_instance_t g_uart6 = { .p_ctrl = &g_uart6_ctrl,
                                  .p_cfg = &g_uart6_cfg, .p_api = &g_uart_on_sci };
void g_hal_init(void) {
    g_common_init();
}
